const qnaList = [
  {
      q: '1. 여러사람과 대화하는 것을 즐기나요?',
      a: [
          { answer: 'a. 네', type: ['E']},
          { answer: 'b. 아니요', type: ['I']},
      ]
  },
  {
      q: '2. 사람이 많은 곳에 있으면 에너지가 충전되나요?',
      a: [
          { answer: 'a. 네. 사람을 보는 것만으로도 에너지가 충전됨', type: ['E']},
          { answer: 'b. 아니요. 집에서 혼자 쉬어야 에너지가 충전됨', type: ['I']},
      ]
  },
  {
      q: '3. 몇 개 월 동안 집에 안 나가도 잘 살 수 있나요?',
      a: [
          { answer: 'a. 네. 상관없어요', type: ['I']},
          { answer: 'b. 아니요. 고통스러울거 같아요', type: ['E']},
      ]
  },
  {
      q: '4. 시나 상상력이 필요한 소설을 잘 쓸 자신이 있는가?',
      a: [
          { answer: 'a. 자신 있음. 상상력이 풍부하고 스토리를 잘 만들어냄. 비유를 잘 사용함', type: ['N']},
          { answer: 'b. 자신없음. 시나 소설보다 사건사고 현장을 자세하게 설명하는 뉴스기사 또는 업무 보고서 같은 걸 자세하게 잘 씀', type: ['S']},
      ]
  },
  {
      q: '5. 아무 생각을 안 할 수 있다? 없다?',
      a: [
          { answer: 'a. 없다. 생각을 휴지통으로 버리는 상상 등을 한다.', type: ['N']},
          { answer: 'b. 있다. 정말 아무 생각도 안한다.', type: ['S']},
      ]
  },
  {
      q: '6. 요리할 때 더 가까운 유형은?',
      a: [
          { answer: 'a. 손대중으로 "이 정도 넣으면 되겠지" ', type: ['N']},
          { answer: 'b. 레시피에 나온대로 정량을 딱 맞춤', type: ['S']},
      ]
  },
  {
      q: '7. 어떤 사건을 보는 초점에 대하여 본인과 가까운 것은?',
      a: [
           { answer: 'a. 사람과 과정, 포괄적인 주변상황 고려', type: ['F']},
          { answer: 'b. 사실여부와 결과, 원리와 원칙', type: ['T']},
      ]
  },
  {
      q: '8. 타인에게 관심을 표하는 방식으로 본인과 가까운 것은?',
      a: [
          { answer: 'a. 리액션을 많이 한다.', type: ['F']},
          { answer: 'b. 질문을 많이 한다.', type: ['T']},
      ]
  },
  {
      q: '9. "나 사고났어"라고 말하는 의도로 본인과 가까운 것은?',
      a: [
          { answer: 'a. 그냥 알아두라는 의도', type: ['F']},
          { answer: 'b. 조금 걱정해달라는 의도', type: ['T']},
      ]
  },
  {
      q: '10. 약속을 앞 두고 당신은?',
      a: [
          { answer: 'a. 시간 다 되어서 준비함', type: ['P']},
          { answer: 'b. 1~2시간 전 부터 준비', type: ['J']},
      ]
  },
  {
      q: '11. 여행 계획을 짤 때, 당신은?',
      a: [
          { answer: 'a. 시간단위로 철저하게 계획 다 짬', type: ['J']},
          { answer: 'b. 대략적인 코스만 짬. 그것조차 안 지키는 경우도 있음', type: ['P']},
      ]
  },
  {
      q: '12. 돌발상황이 생겼을 때, 본인에게 더 가까운 것은?',
      a: [
          { answer: 'a. 돌발상황에 스트레스를 받으며 대처에 약하다.', type: ['J']},
          { answer: 'b. 돌발상황에 융통성을 발휘하여 헤쳐나간다.', type: ['P']},
      ]
  },
       
]