const qnaList = [
    {
        q: '이번 년도도 거의 다 지나갔다. 나는',
        a: [
            { answer: '작년에 만들어둔 계획을 수행하였다', type: ['J']},
            { answer: '계획을 수행하지 않았거나 만들지도 않다', type: ['P']},
        ]
    },

    {
        q: '얼마남지 않은 연말동안 나는',
        a: [
            { answer: '친구들과 연말을 불태운다', type: ['E']},
            { answer: '혼자서 시간을 보낸다', type: ['I']},
        ]
    },

    {
        q: '슬슬 연말&새해 인사를 해야할 시기이다',
        a: [
            { answer: '가까운 지인들에게 먼저 연락을 넣는다', type: ['E']},
            { answer: '먼저 연락을 돌리지 않고, 누군가 하면 그제야 보낸다', type: ['I']},
        ]
    },

    {
        q: '나는 지인들에게 어떤 식으로 연말인사를 할까?',
        a: [
            { answer: '건강 조심하라고 말한다', type: ['S']},
            { answer: '새해엔 행복하자고 말한다', type: ['N']},
        ]
    },

    {
        q: '새해 목표를 세우려고 한다',
        a: [
            { answer: '합리적이고 효율적인 삶을 살고 싶다', type: ['T']},
            { answer: '스트레스와 걱정거리가 없는 삶을 살고 싶다', type: ['F']},
        ]
    },

    {
        q: '친구가 내 목표를 보고 비웃는다',
        a: [
            { answer: '속으로 조금 상처를 받는다', type: ['F']},
            { answer: '어쩌라는 건지 모르겠다', type: ['T']},
        ]
    },
    
    {
        q: '오늘은 12월 31일! 내일이면 새해 1월 1일이다',
        a: [
            { answer: '나이를 먹는게 안타깝다', type: ['S']},
            { answer: '괜히 설렌다', type: ['N']},
        ]
    },
    
    {
        q: '친구가 해맞이를 하러가자고 한다! 나는',
        a: [
            { answer: '들뜬 마음으로 해맞이를 한다', type: ['E']},
            { answer: '사람 많은 건 지치고 귀찮다', type: ['I']},
        ]
    },



    {
        q: '새해가 밝고 내가 할 일은',
        a: [
            { answer: '평소와 다름이 없다', type: ['S']},
            { answer: '특별하고 신선한 일을 하고 싶다', type: ['N']},
        ]
    },

    {
        q: '떡국을 먹으려고 하는 나는',
        a: [
            { answer: '재료를 직접 손질하고 만들어 먹는다', type: ['J']},
            { answer: '귀찮으니 쉽게 조리하거나 조리된 것을 먹는다', type: ['P']},
        ]
    },

    {
        q: '새마음 새뜻으로 대청소를 하려고 한다',
        a: [
            { answer: '하루만에 깔끔하게 정리한다', type: ['J']},
            { answer: '조금씩 며칠에 걸쳐 정리한다', type: ['P']},
        ]
    },

    {
        q: '친구가 새해에는 정신차리고 살라고 한다',
        a: [
            { answer: '내가 실수한게 있는지 걱정된다', type: ['F']},
            { answer: "'지나 잘할 것이지'라는 생각이든다", type: ['T']},
        ]
    },
]