const qnaList = [
  {
      q: '1. 여러사람과 대화하는 것을 즐기나요?',
      a: [
          { answer: 'a. 네', type: ['E']},
          { answer: 'b. 아니요', type: ['I']},
      ]
  },
  {
      q: '2. 사람이 많은 곳에 있으면 에너지가 충전되나요?',
      a: [
          { answer: 'a. 네. 사람을 보는 것만으로도 에너지가 충전됨', type: ['E']},
          { answer: 'b. 아니요. 집에서 혼자 쉬어야 에너지가 충전됨', type: ['I']},
      ]
  },
  {
      q: '3. 몇 개 월 동안 집에 안 나가도 잘 살 수 있나요?',
      a: [
          { answer: 'a. 네. 상관없어요', type: ['I']},
          { answer: 'b. 아니요. 고통스러울거 같아요', type: ['E']},
      ]
  },
  {
      q: '4. 시험이 다가오는데 공부가 손에 안 잡힌다면, 무슨 생각을 하나요?',
      a: [
          { answer: 'a. 시험 없는 세상은 어떨까?', type: ['N']},
          { answer: 'b. 효율적인 공부 방법이 없을까?', type: ['S']},
      ]
  },
  {
      q: '5. 아무 생각을 안 할 수 있다? 없다?',
      a: [
          { answer: 'a. 생각을 휴지통으로 버리는 상상을 한다.', type: ['N']},
          { answer: 'b. 정말 아무 생각도 안한다.', type: ['S']},
      ]
  },
  {
      q: '6. 요리할 때 더 가까운 유형은?',
      a: [
          { answer: 'a. 손대중으로 "이 정도 넣으면 되겠지" ', type: ['N']},
          { answer: 'b. 레시피에 나온대로 정량을 딱 맞춤', type: ['S']},
      ]
  },
  {
      q: '7. 친구가 취업이 안 되어 힘들어 하는 상황일 때, 당신은?',
      a: [
          { answer: 'a. (곤란한 질문은 하지말자) 힘들지ㅠㅠ', type: ['F']},
          { answer: 'b. 무슨 준비하고있는데? 이력서는 넣어봤어?', type: ['T']},
      ]
  },
  {
      q: '8. "우리 잘 안 맞는다"는 말을 들었을 때, 당신은?',
      a: [
          { answer: 'a. ...ㅠㅠ (마음 상함)', type: ['F']},
          { answer: 'b. 왜? 설명해봐 (순수한 궁금증)', type: ['T']},
      ]
  },
  {
      q: '9. 위로를 해야할 상황일 때, 당신이 할 말은?',
      a: [
          { answer: 'a. 그랬구나... 힘내!', type: ['F']},
          { answer: 'b. 왜??.. 왜 그랬는데?', type: ['T']},
      ]
  },
  {
      q: '10. 약속을 앞 두고 당신은?',
      a: [
          { answer: 'a. 시간 다 되어서 준비함', type: ['P']},
          { answer: 'b. 1~2시간 전 부터 준비', type: ['J']},
      ]
  },
  {
      q: '11. 여행 계획을 짤 때, 당신은?',
      a: [
          { answer: 'a. 시간단위 분단위로 계획 다 짬', type: ['J']},
          { answer: 'b. 대략적인 코스만 짬. 그것조차 안 지킴', type: ['P']},
      ]
  },
  {
      q: '12. 과제를 할 때 당신은?',
      a: [
          { answer: 'a. 미리 완료 안하면 불안함', type: ['J']},
          { answer: 'b. 데드라인에 닥쳐서 함', type: ['P']},
      ]
  },
       
]